tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1574_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1574_H_
#define _PIC16LF1574_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTC                         42
#define RC0                           43
#define RC1                           44
#define RC2                           45
#define RC3                           46
#define RC4                           47
#define RC5                           48
#define PIR1                          49
#define TMR1IF                        50
#define TMR2IF                        51
#define TXIF                          52
#define RCIF                          53
#define ADIF                          54
#define TMR1GIF                       55
#define PIR2                          56
#define C1IF                          57
#define C2IF                          58
#define PIR3                          59
#define PWM1IF                        60
#define PWM2IF                        61
#define PWM3IF                        62
#define PWM4IF                        63
#define TMR0                          64
#define TMR1L                         65
#define TMR1H                         66
#define T1CON                         67
#define TMR1ON                        68
#define nT1SYNC                       69
#define T1OSCEN                       70
#define T1CKPS0                       71
#define T1CKPS                        72
#define T1CKPS1                       73
#define TMR1CS                        74
#define TMR1CS0                       75
#define TMR1CS1                       76
#define T1GCON                        77
#define T1GSS0                        78
#define T1GSS                         79
#define T1GSS1                        80
#define T1GVAL                        81
#define T1GGO_nDONE                   82
#define T1GGO                         83
#define T1GSPM                        84
#define T1GTM                         85
#define T1GPOL                        86
#define TMR1GE                        87
#define TMR2                          88
#define PR2                           89
#define T2CON                         90
#define T2CKPS0                       91
#define T2CKPS                        92
#define T2CKPS1                       93
#define TMR2ON                        94
#define T2OUTPS0                      95
#define T2OUTPS                       96
#define T2OUTPS1                      97
#define T2OUTPS2                      98
#define T2OUTPS3                      99
#define TRISA                         100
#define TRISA0                        101
#define TRISA1                        102
#define TRISA2                        103
#define TRISA3                        104
#define TRISA4                        105
#define TRISA5                        106
#define TRISC                         107
#define TRISC0                        108
#define TRISC1                        109
#define TRISC2                        110
#define TRISC3                        111
#define TRISC4                        112
#define TRISC5                        113
#define PIE1                          114
#define TMR1IE                        115
#define TMR2IE                        116
#define TXIE                          117
#define RCIE                          118
#define ADIE                          119
#define TMR1GIE                       120
#define PIE2                          121
#define C1IE                          122
#define C2IE                          123
#define PIE3                          124
#define PWM1IE                        125
#define PWM2IE                        126
#define PWM3IE                        127
#define PWM4IE                        128
#define OPTION_REG                    129
#define OPTION_REG_PS                 130
#define OPTION_REG_PS0                131
#define OPTION_REG_PS1                132
#define OPTION_REG_PS2                133
#define PSA                           134
#define T0SE                          135
#define TMR0SE                        136
#define T0CS                          137
#define TMR0CS                        138
#define INTEDG                        139
#define nWPUEN                        140
#define PCON                          141
#define nBOR                          142
#define nPOR                          143
#define nRI                           144
#define nRMCLR                        145
#define nRWDT                         146
#define STKUNF                        147
#define STKOVF                        148
#define WDTCON                        149
#define SWDTEN                        150
#define WDTPS                         151
#define WDTPS0                        152
#define WDTPS1                        153
#define WDTPS2                        154
#define WDTPS3                        155
#define WDTPS4                        156
#define OSCTUNE                       157
#define TUN0                          158
#define TUN                           159
#define TUN1                          160
#define TUN2                          161
#define TUN3                          162
#define TUN4                          163
#define TUN5                          164
#define OSCCON                        165
#define SCS0                          166
#define SCS                           167
#define SCS1                          168
#define IRCF                          169
#define IRCF0                         170
#define IRCF1                         171
#define IRCF2                         172
#define IRCF3                         173
#define SPLLEN                        174
#define OSCSTAT                       175
#define HFIOFS                        176
#define LFIOFR                        177
#define MFIOFR                        178
#define HFIOFL                        179
#define HFIOFR                        180
#define OSTS                          181
#define PLLR                          182
#define ADRESL                        183
#define ADRESH                        184
#define ADCON0                        185
#define ADON                          186
#define nDONE                         187
#define GO_nDONE                      188
#define GO                            189
#define ADGO                          190
#define CHS0                          191
#define CHS                           192
#define CHS1                          193
#define CHS2                          194
#define CHS3                          195
#define CHS4                          196
#define ADCON1                        197
#define ADPREF0                       198
#define ADPREF                        199
#define ADPREF1                       200
#define ADCS0                         201
#define ADCS                          202
#define ADCS1                         203
#define ADCS2                         204
#define ADFM                          205
#define ADCON2                        206
#define TRIGSEL0                      207
#define TRIGSEL                       208
#define TRIGSEL1                      209
#define TRIGSEL2                      210
#define TRIGSEL3                      211
#define LATA                          212
#define LATA0                         213
#define LATA1                         214
#define LATA2                         215
#define LATA4                         216
#define LATA5                         217
#define LATC                          218
#define LATC0                         219
#define LATC1                         220
#define LATC2                         221
#define LATC3                         222
#define LATC4                         223
#define LATC5                         224
#define CM1CON0                       225
#define C1SYNC                        226
#define C1HYS                         227
#define C1SP                          228
#define C1POL                         229
#define C1OE                          230
#define C1OUT                         231
#define C1ON                          232
#define CM1CON1                       233
#define C1NCH0                        234
#define C1NCH                         235
#define C1NCH1                        236
#define C1NCH2                        237
#define C1PCH                         238
#define C1PCH0                        239
#define C1PCH1                        240
#define C1INTN                        241
#define C1INTP                        242
#define CM2CON0                       243
#define C2SYNC                        244
#define C2HYS                         245
#define C2SP                          246
#define C2POL                         247
#define C2OE                          248
#define C2OUT                         249
#define C2ON                          250
#define CM2CON1                       251
#define C2NCH0                        252
#define C2NCH                         253
#define C2NCH1                        254
#define C2NCH2                        255
#define C2PCH                         256
#define C2PCH0                        257
#define C2PCH1                        258
#define C2INTN                        259
#define C2INTP                        260
#define CMOUT                         261
#define MC1OUT                        262
#define MC2OUT                        263
#define BORCON                        264
#define BORRDY                        265
#define BORFS                         266
#define SBOREN                        267
#define FVRCON                        268
#define ADFVR0                        269
#define ADFVR                         270
#define ADFVR1                        271
#define CDAFVR0                       272
#define CDAFVR                        273
#define CDAFVR1                       274
#define TSRNG                         275
#define TSEN                          276
#define FVRRDY                        277
#define FVREN                         278
#define DACCON0                       279
#define DACPSS                        280
#define DACPSS0                       281
#define DACPSS1                       282
#define DACOE                         283
#define DACLPS                        284
#define DACEN                         285
#define DACCON1                       286
#define DACR0                         287
#define DACR                          288
#define DACR1                         289
#define DACR2                         290
#define DACR3                         291
#define DACR4                         292
#define ANSELA                        293
#define ANSA                          294
#define ANSA0                         295
#define ANSA1                         296
#define ANSA2                         297
#define ANSA4                         298
#define ANSELC                        299
#define ANSC0                         300
#define ANSC                          301
#define ANSC1                         302
#define ANSC2                         303
#define ANSC3                         304
#define PMADRL                        305
#define PMADRH                        306
#define PMDATL                        307
#define PMDATH                        308
#define PMCON1                        309
#define RD                            310
#define WR                            311
#define WREN                          312
#define WRERR                         313
#define FREE                          314
#define LWLO                          315
#define CFGS                          316
#define PMCON2                        317
#define RCREG                         318
#define TXREG                         319
#define SPBRGL                        320
#define SPBRGH                        321
#define RCSTA                         322
#define RX9D                          323
#define OERR                          324
#define FERR                          325
#define ADDEN                         326
#define CREN                          327
#define SREN                          328
#define RX9                           329
#define SPEN                          330
#define TXSTA                         331
#define TX9D                          332
#define TRMT                          333
#define BRGH                          334
#define SENDB                         335
#define SYNC                          336
#define TXEN                          337
#define TX9                           338
#define CSRC                          339
#define BAUDCON                       340
#define ABDEN                         341
#define WUE                           342
#define BRG16                         343
#define SCKP                          344
#define RCIDL                         345
#define ABDOVF                        346
#define WPUA0                         347
#define WPUA                          348
#define WPUA1                         349
#define WPUA2                         350
#define WPUA3                         351
#define WPUA4                         352
#define WPUA5                         353
#define WPUC0                         354
#define WPUC                          355
#define WPUC1                         356
#define WPUC2                         357
#define WPUC3                         358
#define WPUC4                         359
#define WPUC5                         360
#define ODCONA                        361
#define ODA                           362
#define ODA0                          363
#define ODA1                          364
#define ODA2                          365
#define ODA4                          366
#define ODA5                          367
#define ODCONC                        368
#define ODC                           369
#define ODC0                          370
#define ODC1                          371
#define ODC2                          372
#define ODC3                          373
#define ODC4                          374
#define ODC5                          375
#define SLRCONA                       376
#define SLRA                          377
#define SLRA0                         378
#define SLRA1                         379
#define SLRA2                         380
#define SLRA4                         381
#define SLRA5                         382
#define SLRCONC                       383
#define SLRC                          384
#define SLRC0                         385
#define SLRC1                         386
#define SLRC2                         387
#define SLRC3                         388
#define SLRC4                         389
#define SLRC5                         390
#define INLVLA                        391
#define INLVLA0                       392
#define INLVLA1                       393
#define INLVLA2                       394
#define INLVLA3                       395
#define INLVLA4                       396
#define INLVLA5                       397
#define INLVLC                        398
#define INLVLC0                       399
#define INLVLC1                       400
#define INLVLC2                       401
#define INLVLC3                       402
#define INLVLC4                       403
#define INLVLC5                       404
#define IOCAP                         405
#define IOCAP0                        406
#define IOCAP1                        407
#define IOCAP2                        408
#define IOCAP3                        409
#define IOCAP4                        410
#define IOCAP5                        411
#define IOCAN0                        412
#define IOCAN                         413
#define IOCAN1                        414
#define IOCAN2                        415
#define IOCAN3                        416
#define IOCAN4                        417
#define IOCAN5                        418
#define IOCAF0                        419
#define IOCAF                         420
#define IOCAF1                        421
#define IOCAF2                        422
#define IOCAF3                        423
#define IOCAF4                        424
#define IOCAF5                        425
#define IOCCP0                        426
#define IOCCP                         427
#define IOCCP1                        428
#define IOCCP2                        429
#define IOCCP3                        430
#define IOCCP4                        431
#define IOCCP5                        432
#define IOCCN0                        433
#define IOCCN                         434
#define IOCCN1                        435
#define IOCCN2                        436
#define IOCCN3                        437
#define IOCCN4                        438
#define IOCCN5                        439
#define IOCCF0                        440
#define IOCCF                         441
#define IOCCF1                        442
#define IOCCF2                        443
#define IOCCF3                        444
#define IOCCF4                        445
#define IOCCF5                        446
#define CWG1DBR0                      447
#define CWG1DBR                       448
#define CWG1DBR1                      449
#define CWG1DBR2                      450
#define CWG1DBR3                      451
#define CWG1DBR4                      452
#define CWG1DBR5                      453
#define CWG1DBF                       454
#define CWG1DBF0                      455
#define CWG1DBF1                      456
#define CWG1DBF2                      457
#define CWG1DBF3                      458
#define CWG1DBF4                      459
#define CWG1DBF5                      460
#define CWG1CON0                      461
#define G1CS0                         462
#define G1CS                          463
#define G1POLA                        464
#define G1POLB                        465
#define G1OEA                         466
#define G1OEB                         467
#define G1EN                          468
#define CWG1CON1                      469
#define G1IS0                         470
#define G1IS                          471
#define G1IS1                         472
#define G1IS2                         473
#define G1ASDLA                       474
#define G1ASDLA0                      475
#define G1ASDLA1                      476
#define G1ASDLB                       477
#define G1ASDLB0                      478
#define G1ASDLB1                      479
#define CWG1CON2                      480
#define G1ASDSPPS                     481
#define G1ASDSC1                      482
#define G1ASDSC2                      483
#define G1ARSEN                       484
#define G1ASE                         485
#define PWMEN                         486
#define MPWM1EN                       487
#define PWM1EN_A                      488
#define MPWM2EN                       489
#define PWM2EN_A                      490
#define MPWM3EN                       491
#define PWM3EN_A                      492
#define PWM4EN_A                      493
#define PWMLD                         494
#define MPWM1LD                       495
#define PWM1LDA_A                     496
#define MPWM2LD                       497
#define PWM2LDA_A                     498
#define PWM3LDA_A                     499
#define MPWM3LD                       500
#define PWM4LDA_A                     501
#define PWMOUT                        502
#define PWM1OUT_A                     503
#define MPWM1OUT                      504
#define MPWM2OUT                      505
#define PWM2OUT_A                     506
#define MPWM3OUT                      507
#define PWM3OUT_A                     508
#define PWM4OUT_A                     509
#define PWM1PHL                       510
#define PWM1PHL0                      511
#define PWM1PHL_PH                    512
#define PWM1PHL1                      513
#define PWM1PHL2                      514
#define PWM1PHL3                      515
#define PWM1PHL4                      516
#define PWM1PHL5                      517
#define PWM1PHL6                      518
#define PWM1PHL7                      519
#define PWM1PHH                       520
#define PWM1PHH0                      521
